import { Box, Container, Typography } from "@mui/material"
import dateIcon from '../assets/images/date-icon.png'
import blogImg from '../assets/images/blog-details.png'

    const BlogDetails = () => {
    return (
        <Container sx={{direction:'rtl',color:'#ffff', py:'40px'}}>
            <Typography variant="h4">دور التعليم الإلكتروني في تطوير المهارات المهنية</Typography>
            <Box sx={{display:'flex',alignItems:'center', my:'20px'}}>
                <Box
                component='img'
                src={dateIcon}
                alt="date-icon"
                >
                </Box>
                <Typography sx={{pr:'5px'}}>16/11/2024</Typography>
            </Box>
            <Box
            component='img'
            src={blogImg}
            alt="blog-img"
            sx={{width:'100%'}}>
            </Box>
            <Box sx={{my:'30px'}}>
                <Typography sx={{my:'15px'}}>
                    يُعدّ التعليم الإلكتروني أحد أبرز التطورات في مجال التعليم الحديث، حيث أسهم في إتاحة فرص التعلم لعدد أكبر من الأفراد دون التقيد بزمان أو مكان. وقد ساعد هذا النمط التعليمي على تلبية احتياجات المتعلمين المختلفة من خلال محتوى مرن وأساليب تفاعلية حديثة. يعتمد التعليم الإلكتروني على توظيف التقنيات الرقمية لتقديم المعرفة بطريقة فعّالة، مما يتيح للمتعلمين تطوير مهاراتهم وفق وتيرتهم الخاصة، ويسهم في تعزيز التعلم الذاتي والتعلم المستمر. كما أصبح التعليم الإلكتروني خيارًا استراتيجيًا للمؤسسات التعليمية والشركات على حد سواء، لما يوفره من كفاءة في التكلفة وسهولة في إدارة البرامج التدريبية وتحقيق نتائج ملموسة على مستوى الأداء والتطوير.
                </Typography>
                <Typography sx={{my:'15px'}}>
                    يُعدّ التعليم الإلكتروني أحد أبرز التطورات في مجال التعليم الحديث، حيث أسهم في إتاحة فرص التعلم لعدد أكبر من الأفراد دون التقيد بزمان أو مكان. وقد ساعد هذا النمط التعليمي على تلبية احتياجات المتعلمين المختلفة من خلال محتوى مرن وأساليب تفاعلية حديثة. يعتمد التعليم الإلكتروني على توظيف التقنيات الرقمية لتقديم المعرفة بطريقة فعّالة، مما يتيح للمتعلمين تطوير مهاراتهم وفق وتيرتهم الخاصة، ويسهم في تعزيز التعلم الذاتي والتعلم المستمر. كما أصبح التعليم الإلكتروني خيارًا استراتيجيًا للمؤسسات التعليمية والشركات على حد سواء، لما يوفره من كفاءة في التكلفة وسهولة في إدارة البرامج التدريبية وتحقيق نتائج ملموسة على مستوى الأداء والتطوير.
                </Typography>
            </Box>
        </Container>
    )
    }

    export default BlogDetails
